using System.Collections;
using System.Collections.Generic;
using UnityEngine;

/*

#### 第一部 (45分)GameDesign
- **学習の目的の明確化**: 1分
- **3-1 ゲームの設計を考えよう**: 20分
  - 3-1-1 ゲームの企画を作る
  - 3-1-2 ゲームの部品を考える
- **Unity上での個人操作**: 10分
- **生徒同士での説明**: 10分
- **休憩（桜井政博のゲームチャンネル視聴）**: 10分

#### 第二部 (45分)SetForSmartphone
- **3-2 プロジェクトとシーンを作成しよう**: 20分
  - プロジェクトの作成、スマートフォン用に設定、シーンを保存
- **Unity上での個人操作**: 10分
- **生徒同士での説明**: 10分
- **休憩（桜井政博のゲームチャンネル視聴）**: 10分

#### 第三部 (45分)RouletteController ,
- **3-3 から 3-5まで**: 20分
  - シーンにオブジェクトを配置し、ルーレットのスクリプト作成、動作の制御
- **Unity上での個人操作**: 10分
- **生徒同士での説明**: 10分
- **休憩（桜井政博のゲームチャンネル視聴）**: 10分

#### 第四部 (45分)
- **3-6 と 3-7**: 20分
  - ルーレットの挙動を微調整、スマートフォンでの操作調整、ビルドの方法
- **Unity上での個人操作**: 10分
  - iPhoneとAndroidのビルドを実際に行う
- **生徒同士での説明**: 10分
  - 実際にビルドした経験を共有し合う



 */


public class Schedule2 : MonoBehaviour
{
 
}
